brew "gcc"
brew "openssl"
brew "readline" 
brew "sqlite3"
brew "xz"
brew "zlib" 
brew "tcl-tk@8"
brew "libb2"
brew "tmux"

brew "starship"

brew "pyenv"
brew "pyenv-virtualenv"
brew "poetry"
brew "uv"

brew "fzf"
brew "jq"
brew "httpie"
brew "pgcli"
brew "tlrc"
brew "ripgrep"
brew "direnv"

brew "kona"
brew "rlwrap"
