# Build dependencies
brew "gcc"
brew "libb2"
brew "openssl"
brew "readline"
brew "sqlite3"
brew "tcl-tk@8"
brew "xz"
brew "zlib"

# Shell & terminal
brew "starship"
brew "tmux"

# Languages & runtimes
brew "kona"
brew "node"
brew "fnm"
brew "rlwrap"
brew "uv"

# CLI utilities
brew "fzf"
brew "httpie"
brew "jq"
brew "ncdu"
brew "ripgrep"
brew "tlrc"

# Development
tap "hashicorp/tap"
brew "ansible"
brew "coder"
brew "direnv"
brew "gh"
brew "pgcli"
brew "hashicorp/tap/terraform"

# Apps
cask "claude-code"
