anthropic.claude-code
davidanson.vscode-markdownlint
docker.docker
github.vscode-github-actions
github.vscode-pull-request-github
hashicorp.terraform
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.hexeditor
naumovs.color-highlight
njpwerner.autodocstring
redhat.vscode-yaml
rogalmic.bash-debug
samuelcolvin.jinjahtml
shd101wyy.markdown-preview-enhanced
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
